; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and
	       (not (holding ?x))
	       (handempty)
		   (not (clear ?y))
		   (clear ?x)
		   (on ?x ?y)
		 )
  )

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and
	       (not (holding ?x))
	       (handempty)
		   (clear ?x)
		   (ontable ?x)))

  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
		 )
  )

)

; problem
;;; repair: pick-up,(not (handempty )),effNeg,-1

(define 
(problem BLOCKS-4-0)


(:domain
  BLOCKS
)

(:objects 
  A B C D
)

(:INIT
  (CLEAR A) (CLEAR B) (CLEAR C) (CLEAR D)
  (ONTABLE A) (ONTABLE B) (ONTABLE C) (ONTABLE D)
  (HANDEMPTY)
)

(:goal 
  (AND
    (ON D C) (ON C B) (ON B A)
  )
)


)

; plan
1. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 0 of 3
2. (stack b a)
   deleted: (holding b) (clear a)
   added: (handempty) (clear b) (on b a)
   goals met: 1 of 3
3. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 3
4. (stack c b)
   deleted: (holding c) (clear b)
   added: (handempty) (clear c) (on c b)
   goals met: 2 of 3
5. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 2 of 3
6. (stack d c)
   deleted: (holding d) (clear c)
   added: (handempty) (clear d) (on d c)
   goals met: 3 of 3
